Autodesk.Revit.DB.GeometryConversionOptions.IsValidTargetForPoint(Autodesk.Revit.DB.GeometryConversionTarget)
Validates that the chosen option is valid for points (Point or None).
Returns:
True if the option is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.IsValidTargetForCurve(Autodesk.Revit.DB.GeometryConversionTarget)
Validates that the chosen option is valid for curves (Curve or None).
Returns:
True if the option is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.PointOption
Specifies how to convert external points to Revit geometry.
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.CurveOption
Specifies how to convert external curves to Revit geometry.
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.MeshEdgeVisibilityOption
Specifies a backup strategy about the visibility of mesh edges when no EdgeSegmentInfos are present.
Since:
2022